; Iterative factorial, 5! = 120
;
; Conventions:
;   [0x0200] = result (инициализируется в 1)
;   [0x0201] = n      (инициализируется в 5)
;   D0, D1   = временные регистры
;   port 0   = console output
;
; ISA reminders: см. подробный комментарий в fib_recursive.mc
;
; Особенность этого примера — преднамеренная демонстрация CISC-возможности
; работать с памятью прямо в арифметических инструкциях (`MUL [0x0201], D0`,
; `CMP [0x0201], #0` и т.п.) и плотности кодирования: каждая инструкция
; помещается в 1 заголовочное слово + слова расширения только для тех
; операндов, которым реально нужны 32-битные константы или адреса.

; ===== init =====
0100: 0x02105000  ; MOV  #1, [0x0200]            ; desc1=#i32 desc2=[i32]
0101: 0x00000001  ;   ext: #1
0102: 0x00000200  ;   ext: 0x0200
0103: 0x02105000  ; MOV  #5, [0x0201]            ; desc1=#i32 desc2=[i32]
0104: 0x00000005  ;   ext: #5
0105: 0x00000201  ;   ext: 0x0201

; ===== loop: while [n] > 0 =====
0106: 0x55501000  ; CMP  [0x0201], #0            ; desc1=[i32] desc2=#i32
0107: 0x00000201  ;   ext: 0x0201
0108: 0x00000000  ;   ext: #0
0109: 0x63000001  ; BGT  body                    ; offset = +1  (-> 0x010B)
010A: 0x6000000D  ; JMP  end                     ; offset = +13 (-> 0x0118)

; ===== body: result = result * n; n = n - 1 =====
010B: 0x02500000  ; MOV  [0x0200], D0            ; desc1=[i32] desc2=D0
010C: 0x00000200  ;   ext: 0x0200
010D: 0x52500000  ; MUL  [0x0201], D0            ; desc1=[i32] desc2=D0
010E: 0x00000201  ;   ext: 0x0201
010F: 0x02005000  ; MOV  D0, [0x0200]            ; desc1=D0 desc2=[i32]
0110: 0x00000200  ;   ext: 0x0200
0111: 0x02500200  ; MOV  [0x0201], D1            ; desc1=[i32] desc2=D1
0112: 0x00000201  ;   ext: 0x0201
0113: 0x51100200  ; SUB  #1, D1                  ; desc1=#i32 desc2=D1
0114: 0x00000001  ;   ext: #1
0115: 0x02025000  ; MOV  D1, [0x0201]            ; desc1=D1 desc2=[i32]
0116: 0x00000201  ;   ext: 0x0201
0117: 0x60FFFFEE  ; JMP  loop                    ; offset = -18 (-> 0x0106)

; ===== end: вывести результат и встать в halt =====
0118: 0x02500000  ; MOV  [0x0200], D0            ; desc1=[i32] desc2=D0
0119: 0x00000200  ;   ext: 0x0200
011A: 0x57001000  ; OUT  D0, 0                   ; desc1=D0 desc2=#i32
011B: 0x00000000  ;   ext: port 0
011C: 0x74000000  ; HALT                         ; stop simulation
